library(readxl)
library(tidyverse)
library(showtext)
showtext_auto()

df_학자금 <- read_excel('./학자금대출합본.xlsx', col_names= TRUE, sheet = 'Sheet1',
                     col_type = c(rep('text', 8), rep('numeric', 9)))

glimpse(df_학자금)

df_학자금$기준연도 <- fct_relevel(df_학자금$기준연도, '2018', '2019', '2020', '2021')

df_학자금$학기 <- fct_reorder(df_학자금$학기, '1', '2')

df_학자금$지역 <- fct_relevel(df_학자금$지역, '서울', '부산', '대구', '인천', '광주', '대전', '울산', '세종', '경기', '강원', '충북', '충남', '전북', '전남', '경북', '경남', '제주')


df_학자금 <- df_학자금 |>
  filter(구분 == '대학')

df_학자금 |>
  group_by(기준연도, 학기, 지역) |>
  summarise(재학생_합계 = sum(재학생), 
            일반상환_전체_수혜자수 = sum(일반상환_전체_인원), 
            일반상환_전체_평균금액 = sum(일반상환_전체_금액) / sum(일반상환_전체_인원), 
            일반상환_등록금_수혜자수 = sum(일반상환_등록금_인원), 
            일반상환_등록금_평균금액 = sum(일반상환_등록금_금액) / sum(일반상환_등록금_인원),
            취업후상환_전체_수혜자수 = sum(취업후상환_전체_인원), 
            취업후상환_전체_평균금액 = sum(취업후상환_전체_금액) / sum(취업후상환_전체_인원),
            취업후상환_등록금_수혜자수 = sum(취업후상환_등록금_인원), 
            취업후상환_등록금_평균금액 = sum(취업후상환_등록금_금액) / sum(취업후상환_등록금_인원),
            ) |>
  arrange(지역, 기준연도, 학기) |>
  write.csv('clipboard')

            
########################################################################


df_학자금_전문대 <- read_excel('./학자금대출합본_전문대.xlsx', col_names= TRUE, sheet = 'Sheet1',
                     col_type = c(rep('text', 7), rep('numeric', 9)))

glimpse(df_학자금)

df_학자금_전문대$기준연도 <- fct_relevel(df_학자금_전문대$기준연도, '2018', '2019', '2020', '2021')

df_학자금_전문대$학기 <- fct_reorder(df_학자금_전문대$학기, '1', '2')


df_학자금_전문대$지역 <- fct_relevel(df_학자금_전문대$지역, '서울', '부산', '대구', '인천', '광주', '대전', '울산', '세종', '경기', '강원', '충북', '충남', '전북', '전남', '경북', '경남', '제주')


df_학자금_전문대 |>
  group_by(기준연도, 학기, 지역) |>
  summarise(재학생_합계 = sum(재학생), 
                  일반상환_전체_수혜자수 = sum(일반상환_전체_인원), 
                  일반상환_전체_평균금액 = sum(일반상환_전체_금액) / sum(일반상환_전체_인원), 
                  일반상환_등록금_수혜자수 = sum(일반상환_등록금_인원), 
                  일반상환_등록금_평균금액 = sum(일반상환_등록금_금액) / sum(일반상환_등록금_인원),
                  취업후상환_전체_수혜자수 = sum(취업후상환_전체_인원), 
                  취업후상환_전체_평균금액 = sum(취업후상환_전체_금액) / sum(취업후상환_전체_인원),
                  취업후상환_등록금_수혜자수 = sum(취업후상환_등록금_인원), 
                  취업후상환_등록금_평균금액 = sum(취업후상환_등록금_금액) / sum(취업후상환_등록금_인원),
  ) |>
  arrange(지역, 기준연도, 학기) |>
  write.csv('clipboard')
